package com.itstep;
//СИМЕТРИЧНА
//                {1,1,1},
//                {1,1,1},
//                {1,1,1}
//АНТИСИМЕТРИЧНА
//                {1,0,0},
//                {0,1,0},
//                {1,0,0}
//АНТИ І АСИМЕТРИЧНА
//                {0,1,0},
//                {0,0,0},
//                {1,0,0}


public class Task2 {
    public static void main(String[] args) {
        int[][] matrix = {
                {1,1,1},
                {1,1,1},
                {1,1,1}
        };// задаємо матрицю
        int reflectionCounter = 0;// кількість відзеркалень
        int notEmpty = 0;// кількість не пустих комірок
        String status = "";// яка матриця

        if (matrix.length == matrix[0].length){// якщо наша матриця квадратна (кількість рядків дорівнює кількості стовпчиків)
            for (int i = 0; i < matrix.length; i++) {
                for (int j = 0; j < matrix.length; j++) {// проходимося в циклі по кожному елементу матриці
                    if (matrix[i][j] == matrix[j][i] & matrix[i][j] != 0 & i != j){//  якщо є відбиття, тобто воно не пусте і не в діагоналі
                        reflectionCounter++;// додаємо одиницю до нашого лічильника відзеркалень
                    }
                    if (matrix[i][j] != 0 & i != j){// тут просто рахуємо не пусті елементи які також не є в діагоналі
                        notEmpty++;//
                    }
                }
            }
            if (reflectionCounter == notEmpty){//  якшо в нас кількість відбиттів дорівнює кількості не пустих елементів
                status = "симетрична";// наша матриця - симетрична
            }
            else if (reflectionCounter == 0){// якщо відзеркалень не було
                for (int i = 0; i < matrix.length; i++) {// проходимося по елементах матриці ще раз
                    if (matrix[i][i] == 1){// якщо по діагоналі є елементи
                        status = "антисиметрична";// то наша матриця антисиметрична
                    }else if (!status.equals("антисиметрична")) {// якщо ні
                        status = "асиметрична і антисиметрична";// наша матриця асиметрична і антисиметрична
                    }
                }
            }
            else {//
                status = "ні симетрична, ні антисиметрична, ні асиметрична";// якщо нічого вказаного вище, то вона ніяка
            }
            System.out.println("Матриця - " + status);// виводимо наш статус
        }

    }
}
