package com.itstep;
//ТРАНЗИТИВНА
//                {1,1,1,1},
//                {1,1,1,1},
//                {1,1,1,1},
//                {1,1,1,1}

//ТРАНЗИТИВНА
//                {0,0,0,0},
//                {0,0,0,1},
//                {0,0,0,0},
//                {0,0,0,0}

//НЕТРАНЗИТИВНА
//                {1,1,0,0},
//                {1,0,0,0},
//                {0,0,0,0},
//                {0,0,0,0}

public class Task2 {
    public static void main(String[] args) {
        int[][] matrix = {
                {1,1,0,0},
                {1,0,0,0},
                {0,0,0,0},
                {0,0,0,0}
        };// задаємо матрицю
        String status = "транзитивна";// яка матриця

        if (matrix.length == matrix[0].length){// якщо наша матриця квадратна (кількість рядків дорівнює кількості стовпчиків)
            for (int i = 0; i < matrix.length; i++) {// проходимося по всіх рядках
                for (int j = 0; j < matrix.length; j++) {// проходимося по всіх стовпчиках
                    if (matrix[i][j] == 1 & i!=j){// якщо в нас є відношення в цій клітинці і воно не пара (а,а)
                        for (int k = 0; k < matrix.length; k++) {// проходимося ще раз
                            if (matrix[j][k] == matrix[i][k] & !status.equals("не транзитивна")){// якщо пари для транзитивності існують і матриця не мала статусу не транзитивна
                                status = "транзитивна";// то вона транзитивна
                            }else if (k != j){// в інших випадках і якщо це не пара (а,а)
                                status = "не транзитивна";// вона не транзитивна
                            }
                        }
                    }
                }
            }
            System.out.println("Матриця - " + status);// виводимо наш статус
        }

    }
}
